export const mockEvent = {
  id: 44,
  idIdentifier: 'e9b93ae8-5f05-4911-af1a-77706dad3d0a',
  eventTitle: 'Країна Див і Кольорів',
  dateTime: '2024-03-01T19:57:00.000Z',
  description:
    "'Країна Див і Кольорів' — це унікальний фестиваль, який розцвітає серце України кожного року, збираючи під одним небом творців, мрійників та поціновувачів мистецтва. Цей захід втілює в собі безмежну креативність, розмаїття культур та відданість спільному бажанню виражати себе та насолоджуватися неповторною красою життя. Фестиваль проходить на просторі казкового парку, де кожен куток наповнений відчуттям дива та магії. Дерева прикрашені яскравими вішуваннями, алеї прикрашені феєричними фонарями, створюючи неймовірний атмосферний фон для творчих експериментів. Протягом тривалості фестивалю, відбуваються захоплюючі мистецькі виставки, живі концерти різних жанрів, майстер-класи з різноманітних видів мистецтва, від живопису до витинання паперу. Для любителів екстриму працює арена для стрітболу та екстремальних видів спорту. Однак 'Країна Див і Колорів' — це не лише фестиваль мистецтва. Велика частина заходу присвячена соціальним питанням, розвитку громади та зближенню людей. Тут можна зустріти благодійні ярмарки, лекції від відомих гостей, а також обговорення важливих тем сучасності. 'Країна Див і Колорів' — це свято, яке об'єднує та надихає, залишаючи незабутні враження із кожним, хто має сміливість зануритися у світ невичерпної творчості та безмежної любові до життя.",
  eventUrl: null,
  eventImage: 'event1709222132605.jpg',
  eventAddressId: 44,
  locale: 'en_US',
  eventAddress: {
    id: 44,
    city: 'Київ',
    street: 'Ярославська 24',
    notes: '',
    coordinates: '49.04761451133044, 31.387372519412626',
    locale: 'en_US',
  },
  eventTypes: [
    {
      id: 24,
      idIdentifier: '550e8400-e29c-41d4-a716-446655440011',
      eventType: 'Music',
      locale: 'en_US',
    },
    {
      id: 32,
      idIdentifier: 'ed4d14c3-54d6-4380-b942-f9860c208361',
      eventType: 'Party',
      locale: 'en_US',
    },
    {
      id: 33,
      idIdentifier: 'ed4d14c3-74d6-4380-b952-f9860c208361',
      eventType: 'Nature',
      locale: 'en_US',
    },
  ],
};
